In [1]:
### data cleaning

In [3]:
import dill
with open('gaming_raw.pkd', 'rb') as f:
    gaming_raw = dill.load(f)

In [4]:
asin_game = []

In [5]:
def get_asin_game():
    for asin in gaming_raw:
        asin_list = asin['asin']
        asin_game.append(asin_list)

In [6]:
get_asin_game()

In [7]:
asin_game[0]

'B00ETM09LK'

In [ ]:
###for date&price

In [8]:
data_gaming = []

In [9]:
def get_data_game():
    for data in gaming_raw:
        data_list = data['data']
        data_gaming.append(data_list)

In [10]:
get_data_game()

In [ ]:
#price from data

In [17]:
price_game = []

In [18]:
def get_price_game():
    for new in data_gaming:
        new_list = new['NEW']
        price_game.append(new_list)

In [19]:
get_price_game()

In [ ]:
##Date from data

In [21]:
date_game = []

In [24]:
def get_date_game():
    for date in data_gaming:
        date_list = date['NEW_time']
        date_game.append(date_list)

In [25]:
get_date_game()

In [ ]:
##zippin asin & date

In [26]:
game_dict_date = dict(zip(asin_game, date_game))

In [ ]:
##zipping asin & price

In [27]:
game_dict_price = dict(zip(asin_game, price_game))

In [ ]:
##to pandas ASIn amd price

In [28]:
import pandas as pd

In [29]:
df_price_game = pd.DataFrame( [[k,ele] for k,v in game_dict_price.items() for ele in v ])

In [ ]:
##to pandas ASIn amd date

In [30]:
df_date_game = pd.DataFrame( [[k,ele] for k,v in game_dict_date.items() for ele in v ])

In [ ]:
###mergin two df

In [31]:
df_game = pd.concat([df_date_game, df_price_game], axis=1)

In [32]:
df_game.head()

            0                   1           0       1
0  B00ETM09LK 2015-06-25 03:51:00  B00ETM09LK  999.99
1  B00ETM09LK 2015-06-26 05:11:00  B00ETM09LK  999.00
2  B00ETM09LK 2015-07-15 03:05:00  B00ETM09LK  998.99
3  B00ETM09LK 2015-08-16 10:02:00  B00ETM09LK  998.49
4  B00ETM09LK 2015-08-17 02:35:00  B00ETM09LK  998.19

In [33]:
df_game.columns = ['ASIN', 'Date', 'Del', 'Price']

In [34]:
df_game.head()

         ASIN                Date         Del   Price
0  B00ETM09LK 2015-06-25 03:51:00  B00ETM09LK  999.99
1  B00ETM09LK 2015-06-26 05:11:00  B00ETM09LK  999.00
2  B00ETM09LK 2015-07-15 03:05:00  B00ETM09LK  998.99
3  B00ETM09LK 2015-08-16 10:02:00  B00ETM09LK  998.49
4  B00ETM09LK 2015-08-17 02:35:00  B00ETM09LK  998.19

In [35]:
df_game.drop(['Del'], axis=1, inplace=True)

In [36]:
df_game.head()

         ASIN                Date   Price
0  B00ETM09LK 2015-06-25 03:51:00  999.99
1  B00ETM09LK 2015-06-26 05:11:00  999.00
2  B00ETM09LK 2015-07-15 03:05:00  998.99
3  B00ETM09LK 2015-08-16 10:02:00  998.49
4  B00ETM09LK 2015-08-17 02:35:00  998.19

In [174]:
df_game

              ASIN        Date    Price
0       B00ETM09LK  2015/06/25   999.99
1       B00ETM09LK  2015/06/26   999.00
2       B00ETM09LK  2015/07/15   998.99
3       B00ETM09LK  2015/08/16   998.49
4       B00ETM09LK  2015/08/17   998.19
...            ...         ...      ...
264426  B0BNFWQ46H  2022/11/29  2499.00
264427  B0BNGPZ713  2022/11/29  1248.99
264428  B0BNH36TB1  2022/11/29   849.00
264429  B0BNH3YFHD  2022/11/29   949.00
264430  B0BNH4P4F5  2022/11/29   799.00

[264431 rows x 3 columns]

In [175]:
df_game.nunique()

ASIN     10000
Date      2542
Price    65691
dtype: int64

In [37]:
import dill

In [38]:

with open('df_game.pkd', 'wb') as f:
    dill.dump(df_game, f)

In [39]:
df_game['Date'] = df_game['Date'].dt.strftime('%Y/%m/%d')

In [40]:
df_game_clean = df_game.groupby('ASIN').filter(lambda x: len(x) > 10)

In [42]:
df_game_clean.tail()

              ASIN        Date    Price
263848  B0BLH4R831  2022/11/21  1019.79
263849  B0BLH4R831  2022/11/21  1015.79
263850  B0BLH4R831  2022/11/22  1009.79
263851  B0BLH4R831  2022/11/23  1005.79
263852  B0BLH4R831  2022/11/24  1269.00

In [43]:
df_game_clean.reset_index(inplace=True)

In [44]:
df_game_clean.drop('index', axis=1, inplace=True)

In [45]:
df_game_clean.head()

         ASIN        Date   Price
0  B00ETM09LK  2015/06/25  999.99
1  B00ETM09LK  2015/06/26  999.00
2  B00ETM09LK  2015/07/15  998.99
3  B00ETM09LK  2015/08/16  998.49
4  B00ETM09LK  2015/08/17  998.19

In [171]:
df_game_clean.tail()

              ASIN        Date    Price
241396  B0BLH4R831  2022/11/21  1019.79
241397  B0BLH4R831  2022/11/21  1015.79
241398  B0BLH4R831  2022/11/22  1009.79
241399  B0BLH4R831  2022/11/23  1005.79
241400  B0BLH4R831  2022/11/24  1269.00

In [172]:
df_game_clean

              ASIN        Date    Price
0       B00ETM09LK  2015/06/25   999.99
1       B00ETM09LK  2015/06/26   999.00
2       B00ETM09LK  2015/07/15   998.99
3       B00ETM09LK  2015/08/16   998.49
4       B00ETM09LK  2015/08/17   998.19
...            ...         ...      ...
241396  B0BLH4R831  2022/11/21  1019.79
241397  B0BLH4R831  2022/11/21  1015.79
241398  B0BLH4R831  2022/11/22  1009.79
241399  B0BLH4R831  2022/11/23  1005.79
241400  B0BLH4R831  2022/11/24  1269.00

[241401 rows x 3 columns]

In [173]:
df_game_clean.nunique()

ASIN      2873
Date      2542
Price    64521
dtype: int64

In [109]:

with open('df_game_clean.pkd', 'wb') as f:
    dill.dump(df_game_clean, f)